
*** Number
Cojure支持全面的数字类型，甚至包括分数。
#+BEGIN_SRC clojure :exports both
1/2
#+END_SRC

#+RESULTS:
: => 1/2

*** String

字符串只能用双引号定义哦，字符串的连接不再是加号，而是str

#+BEGIN_SRC clojure :exports both
(str "What's your name? " "I'm fine! " "thank you! " "and you?")
#+END_SRC

#+RESULTS:
: => "What's your name? I'm fine! thank you! and you?"

*** Vector

向量是indexed的集合，用方括号初始化
#+BEGIN_SRC clojure :exports both
  [1 2 3 4]
  (vector 1 2 3 4)
#+END_SRC

#+RESULTS:
: => [1 2 3 4]

由于动态类型，还支持向量内的元素可以是任何类型
#+BEGIN_SRC clojure :exports both
(get [1 "2" {3 "4"}] 2)
#+END_SRC

#+RESULTS:
: => {3 "4"}

*** List

和vector类似，但是却稍微不同
#+BEGIN_SRC clojure 
'(1 2 3 4)
(list 1 2 3 4)
#+END_SRC

#+RESULTS:
: => (1 2 3 4)

但是取元素的时候就和vector有所不同了
#+BEGIN_SRC clojure :exports both
  (nth '(1 2 3 4) 2)
#+END_SRC

#+RESULTS:
: => 3

*** Set
集合也一样，元素类型可以随意
#+BEGIN_SRC clojure :exports both
#{"1" 2 :3}
(set ["1" 2 :3 :3])
#+END_SRC

#+RESULTS:
: => #{2 "1" :3}

*** Map
map 非常简单，就像将键值对写在list里，不过需要用花括号

跟其他语言不一样的是key可以是任何东西，甚至是list都可以作为key
#+BEGIN_SRC clojure :exports both
{:smile 😀}
(get-in {:first-name "NiMa" :last-name "Wang" :属性 {:颜值 0 :吐槽能量 100 }} [:属性 :颜值])

#+END_SRC

#+RESULTS:
: => 0

=get-in= 通过一个path数组来找到深度的某个值。
